In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
visa_df = pd.read_csv(r"C:\Users\vinay\Documents\Naresh IT\Data_Files\Visadataset.csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [153]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [155]:
type(visa_df)

pandas.core.frame.DataFrame

- series looks like **dataframe**
- dataframe has column name matrix kind
- Series only have index and its values
- Series is like a Dictionary **Key** and **Value**

In [40]:
keys = visa_df.dtypes.keys()
keys

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [21]:
visa_df.dtypes.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

In [27]:
list(visa_df.dtypes.items())

[('case_id', dtype('O')),
 ('continent', dtype('O')),
 ('education_of_employee', dtype('O')),
 ('has_job_experience', dtype('O')),
 ('requires_job_training', dtype('O')),
 ('no_of_employees', dtype('int64')),
 ('yr_of_estab', dtype('int64')),
 ('region_of_employment', dtype('O')),
 ('prevailing_wage', dtype('float64')),
 ('unit_of_wage', dtype('O')),
 ('full_time_position', dtype('O')),
 ('case_status', dtype('O'))]

## Making the DataFrame ##

In [36]:
pd.DataFrame(visa_df.dtypes)

                             0
case_id                 object
continent               object
education_of_employee   object
has_job_experience      object
requires_job_training   object
no_of_employees          int64
yr_of_estab              int64
region_of_employment    object
prevailing_wage        float64
unit_of_wage            object
full_time_position      object
case_status             object

In [4]:
keys = visa_df.dtypes.keys()
values = visa_df.dtypes.values
pd.DataFrame(zip(keys,values),
            columns=['Keys','Values'])

                     Keys   Values
0                 case_id   object
1               continent   object
2   education_of_employee   object
3      has_job_experience   object
4   requires_job_training   object
5         no_of_employees    int64
6             yr_of_estab    int64
7    region_of_employment   object
8         prevailing_wage  float64
9            unit_of_wage   object
10     full_time_position   object
11            case_status   object

- When we have a Dictionary
- First make in to **Keys** and **Values** separately
- Then Create a Data Frame

### Task 1 : Separate Categorical Columns and Numerical ###

In [5]:
dt = dict(visa_df.dtypes)
categorical_list=[i for i,j in dt.items() if j=='object']
numerical_list=[i for i,j in dt.items() if j!='object']

# for i,j in dt.items():
#     if j=='object':
#         categorical_list.append(i)
#     else:
#         numerical_list.append(i)
print(categorical_list)
print(numerical_list)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

### select_dtype ###

In [6]:
cat = visa_df.select_dtypes(include='object').columns
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [7]:
num = visa_df.select_dtypes(exclude='object').columns
num

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

- Import the Packages
- Read the data
- select_dtypes

## Data Selection ##
- take
- iloc
- loc
### take ###

In [8]:
rows = [100,200,300]
visa_df.take(rows,axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [9]:
col = [1,5]
visa_df.take(col,axis=1).take(rows,axis=0)

    continent  no_of_employees
100      Asia             2227
200      Asia             3282
300      Asia             3268

### Draw Backs of **take** ###
- Manual counting of index of columns
- At a time I can not select rowa and columns, we need to take two **take**

### iloc ###
- iloc[row,columns]
- iloc[start:stop:step,start:stop:step]

In [266]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [10]:
print(visa_df.iloc[1:5,2:5])

  education_of_employee has_job_experience requires_job_training
1              Master's                  Y                     N
2            Bachelor's                  N                     Y
3            Bachelor's                  N                     N
4              Master's                  Y                     N

In [375]:
print(visa_df.iloc[4,2:5])

education_of_employee    Master's
has_job_experience              Y
requires_job_training           N
Name: 4, dtype: object

In [379]:
print(visa_df.iloc[1:5,[2,6,7]])

  education_of_employee  yr_of_estab region_of_employment
1              Master's         2002            Northeast
2            Bachelor's         2008                 West
3            Bachelor's         1897                 West
4              Master's         2005                South

In [383]:
print(visa_df.iloc[[100,200,300],2:5])

    education_of_employee has_job_experience requires_job_training
100              Master's                  Y                     N
200             Doctorate                  Y                     N
300              Master's                  Y                     N

In [387]:
print(visa_df.iloc[[100,200,300],[2,6,7]])

    education_of_employee  yr_of_estab region_of_employment
100              Master's         2007            Northeast
200             Doctorate         1979                 West
300              Master's         2012              Midwest

In [391]:
print(visa_df.iloc[[100],[5]])

     no_of_employees
100             2227

In [395]:
print(visa_df.iloc[4,2:5])

education_of_employee    Master's
has_job_experience              Y
requires_job_training           N
Name: 4, dtype: object

In [399]:
# Selecting a perticular column it gives SERIES output 
print(visa_df.iloc[:,[5]])

       no_of_employees
0                14513
1                 2412
2                44444
3                   98
4                 1082
...                ...
25475             2601
25476             3274
25477             1121
25478             1918
25479             3195

[25480 rows x 1 columns]

In [11]:
visa_df.iloc[[5],:]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.14,Year,Y,Certified

In [12]:
visa_df.iloc[:,[5]]

       no_of_employees
0                14513
1                 2412
2                44444
3                   98
4                 1082
...                ...
25475             2601
25476             3274
25477             1121
25478             1918
25479             3195

[25480 rows x 1 columns]

### loc ###

In [13]:
print(visa_df.loc[1:5,'continent'])

1      Asia
2      Asia
3      Asia
4    Africa
5      Asia
Name: continent, dtype: object

In [377]:
print(visa_df.loc[4,['education_of_employee','has_job_experience','requires_job_training']])

education_of_employee    Master's
has_job_experience              Y
requires_job_training           N
Name: 4, dtype: object

In [381]:
visa_df.loc[1:5,['education_of_employee','has_job_experience','requires_job_training']]

  education_of_employee has_job_experience requires_job_training
1              Master's                  Y                     N
2            Bachelor's                  N                     Y
3            Bachelor's                  N                     N
4              Master's                  Y                     N
5              Master's                  Y                     N

In [385]:
visa_df.loc[[100,200,300],['education_of_employee','has_job_experience','requires_job_training']]

    education_of_employee has_job_experience requires_job_training
100              Master's                  Y                     N
200             Doctorate                  Y                     N
300              Master's                  Y                     N

In [389]:
visa_df.loc[[100,200,300],['education_of_employee','has_job_experience','requires_job_training']]

    education_of_employee has_job_experience requires_job_training
100              Master's                  Y                     N
200             Doctorate                  Y                     N
300              Master's                  Y                     N

In [393]:
print(visa_df.loc[[100],['education_of_employee','has_job_experience','requires_job_training']])

    education_of_employee has_job_experience requires_job_training
100              Master's                  Y                     N

In [397]:
print(visa_df.loc[4,['education_of_employee','has_job_experience','requires_job_training']])

education_of_employee    Master's
has_job_experience              Y
requires_job_training           N
Name: 4, dtype: object

In [401]:
print(visa_df.loc[:,['no_of_employees']])

       no_of_employees
0                14513
1                 2412
2                44444
3                   98
4                 1082
...                ...
25475             2601
25476             3274
25477             1121
25478             1918
25479             3195

[25480 rows x 1 columns]

In [406]:
visa_df.loc[:,'continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object